<파이썬 >
shift + : |

# 주석
ctrl + /: 주석처리
드래그 + ctrl + K + C: 내가 드래그한부분 일괄 주석처리. (반대는 Ctrl K+U)
shift + alt + a: 선택한 행 전체를 여러줄 주석처리

# 선택
clt + shift + 드래그: 가는 곳마다 드래그가 생김. 마우스의 위치따라서. 개편함.
ctrl + D:  반복된 모든 단어를 자동으로 선택해주고, 한번에 수정가능해짐
ctrl + F2: ctrl+d로 선택한 단어들 전체 선택(ctrl + shift + L)
alt + Click  클릭하는것마다 커서가 생겨짐. 한번에 바꿀수있음. 편집끝나고 esc 누르면 떙임
alt + shift + I: 내가 드래그한 코드들을 선택영역 되게함.
ctrl + alt + ↑ / ↓ (위아래로 여러 행을 선택하여 처음 설정한 행에 찍은 커서랑 동일한 위치에 커서생성 후 동일문구 추가 또는 들여쓰기 등 같은 작업 일괄 수행하는 작업)

# 줄 이동.복사.삭제
alt + ↑ / ↓: 선택된 행을 위치변경 위아래로 가능. 여러줄도 가능함
alt + shift + ↑ / ↓: 복사를해서 위아래로 움직이는것.
ctrl + shift + K: 한 행 전체 삭제
Ctrl + K + F: 들여쓰기 같은거 일괄적으로 정렬.

# 커서 이동
ctrl + shift + Enter(바로 위에 위치한 행으로 줄바꿈)
alt + ←/→: 커서가 이전에 위치한곳으로 되돌아가고, 오른쪽은 반대효과. 여러함수 왔다갔다하면서 편집할때 편함.
ctrl + home / end: 코드맨위/아래 한번에(그냥 home / end: 한 줄씩)
ctrl + ↑ / ↓: 마우스 드래그
ctrl + B: 왼쪽 사이드바 없애는것. * code-prfences-keyboard  shortcut 에서 모든 단축키

# 찾기 대체
ctrl + F: 입력한 글자 찾아줌
ctrl + H: 입력한 글자를 찾아서 아랫칸에 있는 글자로 변환


# 노마드코더 익스텐션 5개
1. rest client: REst API 테스트할때 유용함. JWT랑 테스트하고 싶어짐. vsc코드를 rest client로 만들어줌.
2. Waka time: 작업하는것에 대한 시간측정해서 그래프로알려줌
3. polacode: view -> command pallette polacode: 블로그, 깃허브, 튜토리얼 쓰면 복사해서 이미지로 보기 좋게 만들어줌. 이미지로
4. visual studio live share: 라이브쉐어 가능함. 다른사람의 컴퓨터에 들어갈수있음. url 복사해서 다른사람한테 주면 vsc 의 코드를 편집.수정할수있음. 수강생 코드봐줄수도, 협업할때가능함. 도와주거나 ㅣ원, ㅕㅂ업할때 ㅏ능.
5. markdown all in one .: 깃허브때문에 자주사용하는데, 마크다운 파일을 미리보기 할수있음. 미리보기 생성되어 깔끔하게 확인하는게 가능함. 마크다운 실수하는것 방지하고싶으면 이 익스텐션 활용 추천.
6. material theme: 3번째 색사오할용. 좌측하단 클릭해서 색상선택가능. = 색깔바꾸는것.
